/*
* Дан словарь из городов и дат выступлений рок-групп
*
* Необходимо преобразовать словарь (key-value) в массив из названий городов
* Вывод городов должен быть в хронологическом порядке
* Города, в которых концерт уже прошел, нужно исключить
*
* Результат ["Казань", "Санкт-Петербург", "Калининград"]
*/

const data = {
    "Москва": new Date("2020-04-01"),
    "Казань": new Date("2021-07-02"),
    "Владивосток": new Date("2020-04-21"),
    "Калининград": new Date("2021-07-15"),
    "Омск": new Date("2020-04-18"),
    "Санкт-Петербург": new Date("2021-07-10"),
};

function city_date() {
    return;
}

city_date();
